projectTemplate/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          shockFluid;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2e-04;

deltaT          1e-08;

writeControl    runTime;

writeInterval   2e-06;

cycleWrite      0;

writeFormat     ascii;

writePrecision  15;

writeCompression off;

timeFormat      general;

timePrecision   6;

adjustTimeStep  yes;

maxCo           0.05;

maxDeltaT       1;

functions {
  MachNo1 {
    type			MachNo;
    libs			("libfieldFunctionObjects.so");
	writeControl	runTime;
	writeInterval	2e-06;
  }
}


// ************************************************************************* //
